src/oree/oree-out.xml

<soap:Envelope xmlns:ns="http://oree.com.ua/etsua/soapsvc/bankaccountstatus/2020/09" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header><wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:UsernameToken wsu:Id="UsernameToken-3D8E495A71D1035BD516125380512321">
        <wsse:Username>ukrgaz</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">WFtCRyFJt3</wsse:Password>
        </wsse:UsernameToken></wsse:Security>
        </soap:Header>
   <soap:Body>
      <ns:UploadRequest>
         <ns:BANKLIMITS answer-required="true" date-time="2020-10-26T18:51:13Z " dtd-release="1" dtd-version="1" id="5654" message-code="301">
            <ns:SenderIdentification coding-scheme="NAME" id="UGB"/>
            <ns:ReceiverIdentification coding-scheme="EIC" id="62X-OPERRYNKU--3"/>
            <ns:Limits date="2020-10-26T18:51:13Z" title="FinancialLimit">
                
            <ns:Participant 
                        bankAccountId="1" 
                        bankCode="320478" 
                        dic="1" 
                        ean="1" 
                        edrpou="23697280" 
                        eic="0" 
                        iban="UA133204780000026007924864736" 
                        ic="1" 
                        name="АТ ДТЕК ДНІПРОЕНЕРГО" 
                        particId="1">
                <ns:DataGroups>
                     <ns:TotalsData>
                        <ns:Data 
                            currency="UAH" 
                            type="limit" 
                            value="1121.42"/>
                     </ns:TotalsData>
                </ns:DataGroups>
            </ns:Participant>
                               
            <ns:Participant 
                        bankAccountId="1" 
                        bankCode="320478" 
                        dic="1" 
                        ean="1" 
                        edrpou="23697280" 
                        eic="0" 
                        iban="UA133204780000026007924864736" 
                        ic="1" 
                        name="АТ ДТЕК ДНІПРОЕНЕРГО" 
                        particId="1">
                <ns:DataGroups>
                     <ns:TotalsData>
                        <ns:Data 
                            currency="UAH" 
                            type="limit" 
                            value="4312.42"/>
                     </ns:TotalsData>
                </ns:DataGroups>
            </ns:Participant>
               
            </ns:Limits>
         </ns:BANKLIMITS>
      </ns:UploadRequest>
   </soap:Body>
</soap:Envelope>
